zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_TSPC.h
/*
** ###################################################################
**     Processors:          MCXE32BMLL_cm7_core0
**                          MCXE32BMLL_cm7_core1
**                          MCXE32BMPB_cm7_core0
**                          MCXE32BMPB_cm7_core1
**
**     Version:             rev. 1.0, 2025-07-18
**     Build:               b260625
**
**     Abstract:
**         CMSIS Peripheral Access Layer for TSPC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2024-11-19)
**         Initial version.
**     - rev. 1.0 (2025-07-18)
**         Rev2 RM.
**
** ###################################################################
*/

/*!
 * @file PERI_TSPC.h
 * @version 1.0
 * @date 2025-07-18
 * @brief CMSIS Peripheral Access Layer for TSPC
 *
 * CMSIS Peripheral Access Layer for TSPC
 */

#if !defined(PERI_TSPC_H_)
#define PERI_TSPC_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE32BMLL_cm7_core0) || defined(CPU_MCXE32BMPB_cm7_core0))
#include "MCXE32B_cm7_core0_COMMON.h"
#elif (defined(CPU_MCXE32BMLL_cm7_core1) || defined(CPU_MCXE32BMPB_cm7_core1))
#include "MCXE32B_cm7_core1_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- TSPC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TSPC_Peripheral_Access_Layer TSPC Peripheral Access Layer
 * @{
 */

/** TSPC - Size of Registers Arrays */
#define TSPC_GROUP_COUNT                          2u

/** TSPC - Register Layout Typedef */
typedef struct {
  __IO uint32_t GRP_EN;                            /**< Group Enable, offset: 0x0 */
       uint8_t RESERVED_0[76];
  struct {                                         /* offset: 0x50, array step: 0x50 */
    __IO uint32_t GRP_OBE1;                          /**< Group OBE, array offset: 0x50, array step: 0x50 */
    __IO uint32_t GRP_OBE2;                          /**< Group OBE, array offset: 0x54, array step: 0x50 */
         uint8_t RESERVED_0[72];
  } GROUP[TSPC_GROUP_COUNT];
} TSPC_Type;

/* ----------------------------------------------------------------------------
   -- TSPC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TSPC_Register_Masks TSPC Register Masks
 * @{
 */

/*! @name GRP_EN - Group Enable */
/*! @{ */

#define TSPC_GRP_EN_GRP1_EN_MASK                 (0x1U)
#define TSPC_GRP_EN_GRP1_EN_SHIFT                (0U)
/*! GRP1_EN - Enable for GRP1_OBEn Register
 *  0b0..Disable
 *  0b1..Enable
 */
#define TSPC_GRP_EN_GRP1_EN(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_EN_GRP1_EN_SHIFT)) & TSPC_GRP_EN_GRP1_EN_MASK)

#define TSPC_GRP_EN_GRP2_EN_MASK                 (0x2U)
#define TSPC_GRP_EN_GRP2_EN_SHIFT                (1U)
/*! GRP2_EN - Enable for GRP2_OBEn Register
 *  0b0..Disable
 *  0b1..Enable
 */
#define TSPC_GRP_EN_GRP2_EN(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_EN_GRP2_EN_SHIFT)) & TSPC_GRP_EN_GRP2_EN_MASK)
/*! @} */

/*! @name GRP_OBE1 - Group OBE */
/*! @{ */

#define TSPC_GRP_OBE1_OBE0_MASK                  (0x1U)
#define TSPC_GRP_OBE1_OBE0_SHIFT                 (0U)
/*! OBE0 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE0(x)                    (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE0_SHIFT)) & TSPC_GRP_OBE1_OBE0_MASK)

#define TSPC_GRP_OBE1_OBE1_MASK                  (0x2U)
#define TSPC_GRP_OBE1_OBE1_SHIFT                 (1U)
/*! OBE1 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE1(x)                    (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE1_SHIFT)) & TSPC_GRP_OBE1_OBE1_MASK)

#define TSPC_GRP_OBE1_OBE2_MASK                  (0x4U)
#define TSPC_GRP_OBE1_OBE2_SHIFT                 (2U)
/*! OBE2 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE2(x)                    (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE2_SHIFT)) & TSPC_GRP_OBE1_OBE2_MASK)

#define TSPC_GRP_OBE1_OBE3_MASK                  (0x8U)
#define TSPC_GRP_OBE1_OBE3_SHIFT                 (3U)
/*! OBE3 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE3(x)                    (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE3_SHIFT)) & TSPC_GRP_OBE1_OBE3_MASK)

