zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_TSPC.h
#define TSPC_GRP_OBE1_OBE4_MASK                  (0x10U)
#define TSPC_GRP_OBE1_OBE4_SHIFT                 (4U)
/*! OBE4 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE4(x)                    (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE4_SHIFT)) & TSPC_GRP_OBE1_OBE4_MASK)

#define TSPC_GRP_OBE1_OBE5_MASK                  (0x20U)
#define TSPC_GRP_OBE1_OBE5_SHIFT                 (5U)
/*! OBE5 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE5(x)                    (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE5_SHIFT)) & TSPC_GRP_OBE1_OBE5_MASK)

#define TSPC_GRP_OBE1_OBE6_MASK                  (0x40U)
#define TSPC_GRP_OBE1_OBE6_SHIFT                 (6U)
/*! OBE6 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE6(x)                    (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE6_SHIFT)) & TSPC_GRP_OBE1_OBE6_MASK)

#define TSPC_GRP_OBE1_OBE7_MASK                  (0x80U)
#define TSPC_GRP_OBE1_OBE7_SHIFT                 (7U)
/*! OBE7 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE7(x)                    (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE7_SHIFT)) & TSPC_GRP_OBE1_OBE7_MASK)

#define TSPC_GRP_OBE1_OBE8_MASK                  (0x100U)
#define TSPC_GRP_OBE1_OBE8_SHIFT                 (8U)
/*! OBE8 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE8(x)                    (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE8_SHIFT)) & TSPC_GRP_OBE1_OBE8_MASK)

#define TSPC_GRP_OBE1_OBE9_MASK                  (0x200U)
#define TSPC_GRP_OBE1_OBE9_SHIFT                 (9U)
/*! OBE9 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE9(x)                    (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE9_SHIFT)) & TSPC_GRP_OBE1_OBE9_MASK)

#define TSPC_GRP_OBE1_OBE10_MASK                 (0x400U)
#define TSPC_GRP_OBE1_OBE10_SHIFT                (10U)
/*! OBE10 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE10(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE10_SHIFT)) & TSPC_GRP_OBE1_OBE10_MASK)

#define TSPC_GRP_OBE1_OBE11_MASK                 (0x800U)
#define TSPC_GRP_OBE1_OBE11_SHIFT                (11U)
/*! OBE11 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE11(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE11_SHIFT)) & TSPC_GRP_OBE1_OBE11_MASK)

#define TSPC_GRP_OBE1_OBE12_MASK                 (0x1000U)
#define TSPC_GRP_OBE1_OBE12_SHIFT                (12U)
/*! OBE12 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE12(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE12_SHIFT)) & TSPC_GRP_OBE1_OBE12_MASK)

#define TSPC_GRP_OBE1_OBE13_MASK                 (0x2000U)
#define TSPC_GRP_OBE1_OBE13_SHIFT                (13U)
/*! OBE13 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE13(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE13_SHIFT)) & TSPC_GRP_OBE1_OBE13_MASK)

#define TSPC_GRP_OBE1_OBE14_MASK                 (0x4000U)
#define TSPC_GRP_OBE1_OBE14_SHIFT                (14U)
/*! OBE14 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE14(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE14_SHIFT)) & TSPC_GRP_OBE1_OBE14_MASK)

#define TSPC_GRP_OBE1_OBE15_MASK                 (0x8000U)
#define TSPC_GRP_OBE1_OBE15_SHIFT                (15U)
/*! OBE15 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE15(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE15_SHIFT)) & TSPC_GRP_OBE1_OBE15_MASK)

