zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_TSPC.h
#define TSPC_GRP_OBE1_OBE16_MASK                 (0x10000U)
#define TSPC_GRP_OBE1_OBE16_SHIFT                (16U)
/*! OBE16 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE16(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE16_SHIFT)) & TSPC_GRP_OBE1_OBE16_MASK)

#define TSPC_GRP_OBE1_OBE17_MASK                 (0x20000U)
#define TSPC_GRP_OBE1_OBE17_SHIFT                (17U)
/*! OBE17 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE17(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE17_SHIFT)) & TSPC_GRP_OBE1_OBE17_MASK)

#define TSPC_GRP_OBE1_OBE18_MASK                 (0x40000U)
#define TSPC_GRP_OBE1_OBE18_SHIFT                (18U)
/*! OBE18 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE18(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE18_SHIFT)) & TSPC_GRP_OBE1_OBE18_MASK)

#define TSPC_GRP_OBE1_OBE19_MASK                 (0x80000U)
#define TSPC_GRP_OBE1_OBE19_SHIFT                (19U)
/*! OBE19 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE19(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE19_SHIFT)) & TSPC_GRP_OBE1_OBE19_MASK)

#define TSPC_GRP_OBE1_OBE20_MASK                 (0x100000U)
#define TSPC_GRP_OBE1_OBE20_SHIFT                (20U)
/*! OBE20 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE20(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE20_SHIFT)) & TSPC_GRP_OBE1_OBE20_MASK)

#define TSPC_GRP_OBE1_OBE21_MASK                 (0x200000U)
#define TSPC_GRP_OBE1_OBE21_SHIFT                (21U)
/*! OBE21 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE21(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE21_SHIFT)) & TSPC_GRP_OBE1_OBE21_MASK)

#define TSPC_GRP_OBE1_OBE22_MASK                 (0x400000U)
#define TSPC_GRP_OBE1_OBE22_SHIFT                (22U)
/*! OBE22 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE22(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE22_SHIFT)) & TSPC_GRP_OBE1_OBE22_MASK)

#define TSPC_GRP_OBE1_OBE23_MASK                 (0x800000U)
#define TSPC_GRP_OBE1_OBE23_SHIFT                (23U)
/*! OBE23 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE23(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE23_SHIFT)) & TSPC_GRP_OBE1_OBE23_MASK)

#define TSPC_GRP_OBE1_OBE24_MASK                 (0x1000000U)
#define TSPC_GRP_OBE1_OBE24_SHIFT                (24U)
/*! OBE24 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE24(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE24_SHIFT)) & TSPC_GRP_OBE1_OBE24_MASK)

#define TSPC_GRP_OBE1_OBE25_MASK                 (0x2000000U)
#define TSPC_GRP_OBE1_OBE25_SHIFT                (25U)
/*! OBE25 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE25(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE25_SHIFT)) & TSPC_GRP_OBE1_OBE25_MASK)

#define TSPC_GRP_OBE1_OBE26_MASK                 (0x4000000U)
#define TSPC_GRP_OBE1_OBE26_SHIFT                (26U)
/*! OBE26 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE26(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE26_SHIFT)) & TSPC_GRP_OBE1_OBE26_MASK)

#define TSPC_GRP_OBE1_OBE27_MASK                 (0x8000000U)
#define TSPC_GRP_OBE1_OBE27_SHIFT                (27U)
/*! OBE27 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE27(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE27_SHIFT)) & TSPC_GRP_OBE1_OBE27_MASK)

#define TSPC_GRP_OBE1_OBE28_MASK                 (0x10000000U)
#define TSPC_GRP_OBE1_OBE28_SHIFT                (28U)
/*! OBE28 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE28(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE28_SHIFT)) & TSPC_GRP_OBE1_OBE28_MASK)

#define TSPC_GRP_OBE1_OBE29_MASK                 (0x20000000U)
#define TSPC_GRP_OBE1_OBE29_SHIFT                (29U)
/*! OBE29 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE29(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE29_SHIFT)) & TSPC_GRP_OBE1_OBE29_MASK)

