zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_TSPC.h
#define TSPC_GRP_OBE1_OBE30_MASK                 (0x40000000U)
#define TSPC_GRP_OBE1_OBE30_SHIFT                (30U)
/*! OBE30 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE30(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE30_SHIFT)) & TSPC_GRP_OBE1_OBE30_MASK)

#define TSPC_GRP_OBE1_OBE31_MASK                 (0x80000000U)
#define TSPC_GRP_OBE1_OBE31_SHIFT                (31U)
/*! OBE31 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE1_OBE31(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE1_OBE31_SHIFT)) & TSPC_GRP_OBE1_OBE31_MASK)
/*! @} */

/* The count of TSPC_GRP_OBE1 */
#define TSPC_GRP_OBE1_COUNT                      (2U)

/*! @name GRP_OBE2 - Group OBE */
/*! @{ */

#define TSPC_GRP_OBE2_OBE32_MASK                 (0x1U)
#define TSPC_GRP_OBE2_OBE32_SHIFT                (0U)
/*! OBE32 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE32(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE32_SHIFT)) & TSPC_GRP_OBE2_OBE32_MASK)

#define TSPC_GRP_OBE2_OBE33_MASK                 (0x2U)
#define TSPC_GRP_OBE2_OBE33_SHIFT                (1U)
/*! OBE33 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE33(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE33_SHIFT)) & TSPC_GRP_OBE2_OBE33_MASK)

#define TSPC_GRP_OBE2_OBE34_MASK                 (0x4U)
#define TSPC_GRP_OBE2_OBE34_SHIFT                (2U)
/*! OBE34 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE34(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE34_SHIFT)) & TSPC_GRP_OBE2_OBE34_MASK)

#define TSPC_GRP_OBE2_OBE35_MASK                 (0x8U)
#define TSPC_GRP_OBE2_OBE35_SHIFT                (3U)
/*! OBE35 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE35(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE35_SHIFT)) & TSPC_GRP_OBE2_OBE35_MASK)

#define TSPC_GRP_OBE2_OBE36_MASK                 (0x10U)
#define TSPC_GRP_OBE2_OBE36_SHIFT                (4U)
/*! OBE36 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE36(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE36_SHIFT)) & TSPC_GRP_OBE2_OBE36_MASK)

#define TSPC_GRP_OBE2_OBE37_MASK                 (0x20U)
#define TSPC_GRP_OBE2_OBE37_SHIFT                (5U)
/*! OBE37 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE37(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE37_SHIFT)) & TSPC_GRP_OBE2_OBE37_MASK)

#define TSPC_GRP_OBE2_OBE38_MASK                 (0x40U)
#define TSPC_GRP_OBE2_OBE38_SHIFT                (6U)
/*! OBE38 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE38(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE38_SHIFT)) & TSPC_GRP_OBE2_OBE38_MASK)

#define TSPC_GRP_OBE2_OBE39_MASK                 (0x80U)
#define TSPC_GRP_OBE2_OBE39_SHIFT                (7U)
/*! OBE39 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE39(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE39_SHIFT)) & TSPC_GRP_OBE2_OBE39_MASK)

#define TSPC_GRP_OBE2_OBE40_MASK                 (0x100U)
#define TSPC_GRP_OBE2_OBE40_SHIFT                (8U)
/*! OBE40 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE40(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE40_SHIFT)) & TSPC_GRP_OBE2_OBE40_MASK)

#define TSPC_GRP_OBE2_OBE41_MASK                 (0x200U)
#define TSPC_GRP_OBE2_OBE41_SHIFT                (9U)
/*! OBE41 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE41(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE41_SHIFT)) & TSPC_GRP_OBE2_OBE41_MASK)

#define TSPC_GRP_OBE2_OBE42_MASK                 (0x400U)
#define TSPC_GRP_OBE2_OBE42_SHIFT                (10U)
/*! OBE42 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE42(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE42_SHIFT)) & TSPC_GRP_OBE2_OBE42_MASK)

#define TSPC_GRP_OBE2_OBE43_MASK                 (0x800U)
#define TSPC_GRP_OBE2_OBE43_SHIFT                (11U)
/*! OBE43 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE43(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE43_SHIFT)) & TSPC_GRP_OBE2_OBE43_MASK)

#define TSPC_GRP_OBE2_OBE44_MASK                 (0x1000U)
#define TSPC_GRP_OBE2_OBE44_SHIFT                (12U)
/*! OBE44 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE44(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE44_SHIFT)) & TSPC_GRP_OBE2_OBE44_MASK)

#define TSPC_GRP_OBE2_OBE45_MASK                 (0x2000U)
#define TSPC_GRP_OBE2_OBE45_SHIFT                (13U)
/*! OBE45 - Output Buffer Enable
 *  0b0..OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.
 *  0b1..OBE pad transitions from high to low if any OBE in group transitions from high to low.
 */
#define TSPC_GRP_OBE2_OBE45(x)                   (((uint32_t)(((uint32_t)(x)) << TSPC_GRP_OBE2_OBE45_SHIFT)) & TSPC_GRP_OBE2_OBE45_MASK)
/*! @} */

/* The count of TSPC_GRP_OBE2 */
#define TSPC_GRP_OBE2_COUNT                      (2U)


/*!
 * @}
 */ /* end of group TSPC_Register_Masks */


/*!
 * @}
 */ /* end of group TSPC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_TSPC_H_ */

